cases/cylinder2D/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 20000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 13.14989;
    }

    outlet
    {
        type            zeroGradient;
    }

    open
    {
        type            slip;
    }

    cyl
    {
        type            omegaWallFunction;
        value           uniform 13.14989;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
